package tuanz.core.constant;

/**
 * Created by Yxm on 2017/7/31.
 */
public class PCConstant {
    public static final String SESSION_CURRENT_PC = "SESSION_CURRENT_PC";
    public static final String SKILLNAME[] = {
            //59个技能
            "心理学","话术","信誉","劝说","议价",//0-4
            "跳跃","领航术","野外生存（山）", "野外生存（海)","野外生存（沙漠）",//5-9
            "游泳","驾驶（汽车）","骑乘","图书馆利用", "攀爬",//10-14
            "闪躲","侦查","聆听","乔装","开锁",//15-19
            "跟踪","躲藏", "潜行","藏匿","人类学",//20-24
            "神秘学","化学","天文学","生物学","地质学",//25-29
            "自然史","法律","物理学","博物学","会计学",//30-34
            "历史", "重机械操作","机械维修","电器维修","电脑使用",//35-39
            "电子学","摄影", "拳击/厮打","擒抱","头槌",//40-44 40电子学 6版职业中不存在
            "日本刀","杖","匕首", "踢击", "手枪",//45-49 48踢击不存在
            "投掷","来复枪","散弹枪","心理分析","急救",//50-54 51来复枪不存在
            "医学", "药剂学", "威胁","魅力",//55-58  56威胁不存在 58魅力不存在
            //11个自定义技能
            "drive1","drive2", //59 60 自定义驾驶
            "crafte1","crafte2", //61 62 自定义手艺
            "art1", "art2", //63 64 自定义艺术
            "budo",//65 自定义武道
            "bow",// 66 指定弓
            "language1",//67 指定母语
            "language2", "language3"//68 69 指定额外语言
    };
    public static final Integer SKILLDEFAULT[] = {
            5,5,15,15,5,25,25,1,1,1,25,20,5,25,40,25,25,25,1,1,
            10,10,10,15,1,5,1,1,1,1,10,5,1,10,10,20,1,20,10,
            1,1,10,50,25,10,15,25,25,25,20,25,25,30,1,30,5,1,15,15,
            20,20,5,5,5,5,1,5,75,1,1
    };





}
